@echo off
:: **************************************************************************************************************
::  <説明>
::  以前、業務で効率化のために作成したバッチを記憶を頼りにポートフォリオ用に再現しました。
::  以下の処理は実務に使用できるなら使用していただいて構いません。
::  ただし、ポートフォリオ用なので十分なテストは行えておらず、動作の保証はできません。
::
::  <作成情報>
::  作成者  ：神部 慶太
::  作成日  ：2025/12/29
::  開発期間：約1日(初回アップロード時点)
::  
::  <使い方>
::  1)起動パラメータなしで起動した場合、対象フォルダに対して検索を行う
::  2)起動パラメータありで起動した場合、デフォルトの検索先に対して検索を行う
:: **************************************************************************************************************


:: *******************************************************************************************
:: * パラメータ取得処理
:: *******************************************************************************************
::--ローカル環境変数設定--
setlocal

if "%~1"=="" (
	::第一パラメータが空の場合
	set "dir=C:\Users" & rem デフォルト検索フォルダ設定処理
) else (
	::第一パラメータが空でない場合
	set "dir=%~1"        & rem 第一パラメータ設定処理
)

:: *******************************************************************************************
:: * フォルダ存在チェック
:: *******************************************************************************************
if not exist "%dir%" (
	echo *****************************************************************************************
	echo * フォルダが存在しません。%dir%
	echo * 処理を終了します。
	echo *****************************************************************************************
	cmd /k
)

set "ver=0.0.1"
:reInput
echo *****************************************************************************************
echo * ファイル名検索バッチ	（ver:%ver%）
echo * =======================================================================================
echo * 検索を開始します。
echo * 検索する単語を入力してください。
echo * 検索対象フォルダ：%dir%
echo * 検索の途中で処理を止める場合、Ctrl+Cを押してください。
echo *****************************************************************************************


set "input="
:err
::--入力待機処理--
if "%input%" == "" (
	set /p "input="
)

::--入力値判定--
if not defined input (
	echo 入力値が不正です。正しい値を入力してください。
	set "input="
	goto :err
)

::--検索処理--
where /R "%dir%" *"%input%"*


echo *****************************************************************************************
echo * 検索が終了しました。
echo * もう一度、検索する場合はEnterを押してください。
echo *****************************************************************************************

::-- 一時停止処理（メッセージ表示なし）--
pause > nul

::--クリアスクリーン--
cls

::--ラベル位置にジャンプ--
goto :reInput

::--ローカル環境変数設定終了--
endlocal

::--コマンドプロンプト切替処理--
::cmd /k

