#!/usr/bin/bash 

#==============================================================================================================
#<説明>
#自宅環境でのLinux学習中に作成したshファイルです。
#Linuc資格の学習のために作成しました。
#本プログラムは、Linuxサーバ上のメタ情報を画面、ログに出力します。
#
#品質に問題がないことを確認したつもりではありますが、念のため実行前にコードチェックのうえ実行していただけますと幸いです。

#<作成情報>
#作成者  ：神部 慶太
#作成日  ：2026/08頃
#
#<処理内容>
#1)第一引数の値がdの場合、シェルをデバッグモードに切り替える
#2)サーバ上のメタ情報を画面、ログに出力する
#
#バージョン：v.0.0.1
#==============================================================================================================




#==============================================================================================================
#1)デバッグ用パラメータ判定
#==============================================================================================================
if [ "${1}" = "d" ]; then
    set -x
fi

#==============================================================================================================
#2)メタ情報の出力
#==============================================================================================================

#ヘッダ情報出力
printf "%-20s %-30s %s\n" "name" "result" "status"
printf "===================================================\n"


#ユーザー名 出力
printf "%-20s:%-30s:%s\n" "user" "$(whoami)" "${?}"

#現在ディレクトリ 出力
printf "%-20s:%-30s:%s\n" "dir" "$(pwd)" "${?}"

#ホスト名 出力
printf "%-20s:%-30s:%s\n" "hostname" "$(hostname)" "${?}"

#ログイン日時 出力
printf "%-20s:%-30s:%s\n" "login date" "$(LANG=C date)" "${?}"

#文字コード 出力
printf "%-20s:%-30s:%s\n" "char set" "$LANG" "${?}"


#Ping情報 設定
addr="8.8.8.8"
cnt="1"
ping -c "$cnt" "$addr" 1>/dev/null 2>/dev/null

#Ping実行結果 判定
rslt=${?}
if [ "$rslt" = "0" ]; then
    msg="success"
else
    msg="failure"
fi

#Ping実行結果 出力
printf "%-20s:%-30s:%s\n" "ping($addr)" "$msg" "$rslt"
