@echo off
:: ==============================================================================================================
::  <説明>
::  リモート面談用の準備のためのbatを作成
::  
::  品質に問題がないことを確認したつもりではありますが、念のため実行前にコードチェックのうえ実行していただけますと幸いです。
::
::  <作成情報>
::  作成者  ：神部 慶太
::  作成日  ：2026/09/09
::  開発期間：約1時間(初回アップロード時点)
::  
::  <処理>
::  1)ファイルオープン処理
::  2)システム設定オープン(システム>サウンド>プロパティ)
:: ==============================================================================================================

::--ローカル環境変数設定--
setlocal
::--プログラムバージョン--
set "ver=1.0.0"

:: ===========================================================================================
::  変数宣言
:: ===========================================================================================
set "openDir=C:\portfolio\XX_Private"

:: ===========================================================================================
::  1)ファイルオープン処理
:: ===========================================================================================
::指定ディレクトリの全xlsxを最大化で開く
for %%f in ("%openDir%\*.xlsx") do (
    start "" /max "%%f"
)

::指定ディレクトリの全pdfを最大化で開く
for %%f in ("%openDir%\*.pdf") do (
    start "" /max "%%f"
)

:: ===========================================================================================
::  2)システム設定オープン
:: ===========================================================================================
::システム>サウンド>プロパティ オープン
start ms-settings:sound-defaultinputproperties


:: ===========================================================================================
::  3)リモート面談注意点の表示
:: ===========================================================================================
echo  ===========================================================================================
echo   準備事項
echo  ===========================================================================================
echo  1)マイクの入力テスト
echo  2)スキルシート準備
echo  3)面談URLをブラウザで開く
echo  4)参加時の背景設定
echo  5)入室時ミュートになっていないかチェックする(4人以上の場合)
echo  6)イヤホン等の充電
echo.

::--ローカル環境変数設定終了--
endlocal

::--一時停止--
@pause

::--プロンプト終了--
exit

::--コマンドプロンプト切替処理--
::cmd /k